{
  "response": "**Final Medical Report**\n\n**1. Patient Identification and Summary**\n\n*   **Age:** Not provided\n*   **Sex:** Not provided\n*   **Relevant Background:** Afaq Ahmad presents with a chief complaint of a headache. He has a history of hypertension and an appendectomy. He is currently taking Lisinopril and Metformin. He reports numbness in his whole body.\n\n**2. Chief Complaint**\n\nHeadache.\n\n**3. History of Present Illness (HPI)**\n\nPatient reports a headache that started 7 days ago. The headache is located on the right side of the head and is extremely severe.\n\n**4. Relevant Past Medical History**\n\n*   Hypertension (diagnosed 2018)\n*   Appendectomy (2010)\n\n**5. Clinical Findings**\n\n*   Numbness in the whole body.\n\n**6. Assessment and Differential Diagnosis**\n\nThe patient presents with a severe, persistent headache on the right side of the head, accompanied by numbness in the whole body. The differential diagnosis includes:\n\n*   **Migraine:** The patient reports a severe headache on the right side of the head. While the patient denies photophobia and phonophobia, these symptoms are not always present in migraines. The patient also reports numbness in the whole body, which can be associated with migraine aura. The headache is constant, which is less typical for migraines, but possible. The duration of the headache is 7 days, which is also consistent with migraine.\n*   **Tension-type headache:** The patient reports a persistent headache on the right side of the head. Tension-type headaches are often described as a tight band around the head. The patient denies photophobia and phonophobia, which are more common in migraines. The patient also reports numbness in the whole body, which can be associated with tension-type headaches. The headache is constant, which is less typical for tension-type headaches, but possible. The duration of the headache is 7 days, which is also consistent with tension-type headaches.\n\n**7. Plan and Recommendations**\n\n*   Neurological exam to assess for focal neurological deficits.\n*   Further investigation into the cause of the headache and numbness is warranted.\n*   Consider imaging studies (e.g., MRI of the brain) if neurological deficits are present or if the headache does not respond to initial treatment.\n*   Monitor for"
}